Repository: marschap/isdn4k-utils
Catalog: vbox/messages/*.po
Languages: de

source: 1) The default (buildin) value (%s).
de: 1) Der im Programm eingebundene Wert (%s).

source: 2) The value of the environment variable VBOXSPOOL (if set).
de: 2) Der Wert der Environment Variable VBOXSPOOL (wenn gesetzt).

source: 3) The directory of the command line option "--spooldir".
de: 3) Das Argument der Option "--spooldir".

source: (timeout)
de: (Zeitbegrenzung)

source: " (ignored)...
de: " (ignoriert)...

source: " (need a "<DLE>").
de: " (brauche ein "<DLE>").

source: %ld bytes available; %ld bytes needed...
de: %ld Byte's sind verfügbar; %ld Byte's werden benötigt...

source: %s: Setup "%s" doesn't exist.
de: %s: Konfigurationsdatei "%s" existiert nicht.

source: %s: can't connect to '%s'.
de: %s: kann nicht zu '%s' verbinden.

source: %s: can't create "%s".
de: %s: kann "%s" nicht erzeugen.

source: %s: can't create a temporary file.
de: %s: kann temporäre Datei nicht erzeugen.

source: %s: can't create control file "%s".
de: %s: kann die Kontrolldatei "%s" nicht erzeugen.

source: %s: can't find running %s process.
de: %s: kann keinen laufenden Prozeß von %s finden.

source: %s: can't get passwd entry for uid %d.
de: %s: kann den Passworteintrag der Benutzer-ID %d nicht finden.

source: %s: can't get service 'vboxd/tcp' - please read the manual.
de: %s: kann Service 'vboxd/tcp' nicht finden - bitte Anleitung lesen.

source: %s: can't initialize screen.
de: %s: kann den Bildschirm nicht initialisieren.

source: %s: can't login as '%s'.
de: %s: kann nicht als '%s' einloggen.

source: %s: can't open "%s" (au sample test).
de: %s: kann "%s" nicht öffnen (au-Sample-Test).

source: %s: can't open "%s" (vbox sample test).
de: %s: kann "%s" nicht öffnen (vbox-Sample-Test).

source: %s: can't read input.
de: %s: kann nicht vom Eingabekanal (stdin) lesen.

source: %s: can't read vbox audio header.
de: %s: kann den "vbox audio header" nicht lesen.

source: %s: can't remove control file "%s".
de: %s: kann die Kontrolldatei "%s" nicht entfernen.

source: %s: can't write output.
de: %s: kann nicht zum Ausgabekanal (stdout) schreiben.

source: %s: can't write vbox audio header.
de: %s: kann "vbox audio header" nicht schreiben.

source: %s: control file "%s" allready exists.
de: %s: die Kontrolldatei "%s" exixtiert bereits.

source: %s: control file "%s" created.
de: %s: die Kontrolldatei "%s" wurde erzeugt.

source: %s: control file "%s" doesn't exist.
de: %s: die Kontrolldatei "%s" existiert nicht.

source: %s: control file "%s" removed.
de: %s: die Kontrolldatei "%s" wurde entfernt.

source: %s: device "%s" is not accessable.
de: %s: Gerätetreiber "%s" ist nicht ansprechbar.

source: %s: error sending signal (%s).
de: %s: Fehler beim senden des Signals (%s).

source: %s: illegal magic number for an au file.
de: %s: Illegale "magic number" für eine au-Datei.

source: %s: must be run by root!
de: %s: muß vom Benutzer root gestartet werden!

source: %s: number of channels != 1 (only mono supported).
de: %s: Mehr als ein Kanal wird benutzt (z.Z. wird nur Mono unterstützt).

source: %s: oops - don't know what I should do!
de: %s: ich weiß nicht was ich machen soll!

source: %s: sample contains no vbox audio header.
de: %s: die Datei enthält keinen "vbox audio header".

source: %s: sample contains no vbox or sun au header.
de: %s: die Datei enthält weder einen "vbox audio header" noch einen "au header".

source: %s: screen dimensions too small - need 80x24 or greater.
de: %s: die Bildschirmauflösung ist zu klein - benötigt werden min. 80x24.

source: %s: sending signal to stop beep's to process %d...
de: %s: sende Signal zum stoppen der Beep's an Prozeß %d...

source: %s: sending terminate signal to process %d...
de: %s: sende Signal zum terminieren an Prozeß %d...

source: %s: unexpected EOF.
de: %s: unerwartetes Dateiende.

source: %s: unknown/unsupported compression %d.
de: %s: unbekannte oder nicht unterstützte Kompression.

source: %s: unsupported compression type.
de: %s: nicht unterstützte Kompression.

source: %s: unsupported or illegal sound encoding.
de: %s: nicht unterstütztes oder falsches Musikformat.

source: %s: you must be *root* to kill a running %s.
de: %s: nur *root* kann einen laufendes %s beenden.

source: %s: you must be *root* to start %s.
de: %s: nur *root* kann %s starten.

source: %s: you must enter a login name and a password.
de: %s: du mußt einen Login-Namen und ein Passwort angeben.

source: %s: you must specify a control name to create/remove.
de: %s: es muß der Name einer Kontrolldatei angegeben werden.

source: - For au samples it returns %d-%d,
de: - Für au-Dateien wird %d-%d zurückgegeben,

source: - For unknown formats or on errors it returns 255.
de: - Für unbekannte Formate oder bei einem Fehler wird 255 zurückgegeben.

source: - For vbox messages it returns 2-6,
de: - Für vbox-Nachrichten wird 2-6 zurückgegeben,

source: ------------------------[End session]-----------------------
de: -----------------------[Programmende]-----------------------

source: -----------------------[Begin session]----------------------
de: -----------------------[Programmstart]----------------------

source: -1, --linear8 Use 8-bit linear output.
de: -1, --linear8 8-Bit Linear Ausgabe benutzen.

source: -2, --adpcm-2 Converts sample to adpcm-2.
de: -2, --adpcm-2 Konvertiert Datei nach "adpcm-2".

source: -2, --linear16 Use 16-Bit linear output (default).
de: -2, --linear16 16-Bit Linear Ausgabe benutzen (Voreinstellung).

source: -3, --adpcm-3 Converts sample to adpcm-3.
de: -3, --adpcm-3 Konvertiert Datei nach "adpcm-3".

source: -4, --adpcm-4 Converts sample to adpcm-4 (default).
de: -4, --adpcm-4 Konvertiert Datei nach "adpcm-4" (Voreinstellung).

source: -a, --answerall Control file "vboxctrl-answerall".
de: -a, --answerall Kontrolldatei "vboxctrl-answerall".

source: -c, --create Removes a control file (default).
de: -c, --create Entfernt eine Kontrolldatei (Voreinstellung).

source: -c, --playcmd PROG Use PROG to play messages (%s).
de: -c, --playcmd PROG Benutzt PROG zum Nachr. spielen (%s).

source: -d, --device TTY Use device TTY for modem operations [required].
de: -d, --device TTY Benutze Gerätetreiber TTY für Modem-Operationen [benötigt].

source: -f, --file FILE Overwrites "%s".
de: -f, --file FILE Überschreibt "%s".

source: -f, --force Force login prompt.
de: -f, --force Erzwingt einen Login-Prompt.

source: -h, --help Prints this usage message.
de: -h, --help Zeigt diesen Hilfstext an.

source: -h, --help Prints this usage message.
de: -h, --help Zeigt diesen Hilfstext an.

source: -h, --help Displays this help text.
de: -h, --help Zeigt diesen Hilfstext an.

source: -h, --help Display usage message.
de: -h, --help Zeigt diesen Hilfstext an.

source: -h, --help Displays this short help.
de: -h, --help Zeigt diesen Hilfstext an.

source: -h, --help Displays this usage message.
de: -h, --help Zeigt diesen Hilfstext an.

source: -i, --machine HOST Connect to message server on HOST (default: localhost).
de: -i, --machine HOST Nachrichten-Server ist HOST (Voreinst.: localhost).

source: -j, --reject Control file "vboxctrl-reject".
de: -j, --reject Kontrolldatei "vboxctrl-reject".

source: -l, --language Overwrites environment LANG.
de: -l, --language Überschreibt die Environment-Variable LANG.

source: -l, --location LOCATION Sets header information.
de: -l, --location LOCATION Setzt Information im "audio header".

source: -m, --hostname NAME Connect to host NAME (localhost).
de: -m, --hostname NAME Verbindet zu Host NAME (localhost).

source: -m, --messagebox DIR Watch directory DIR for new messages.
de: -m, --messagebox DIR Verzeichnis DIR auf neue Nachrichten überwachen.

source: -n, --answernow Control file "vboxctrl-answernow".
de: -n, --answernow Kontrolldatei "vboxctrl-answernow".

source: -n, --name NAME Sets header information.
de: -n, --name NAME Setzt Information im "audio header".

source: -o, --mono Force mono color (color if terminal have).
de: -o, --mono Erzwingt Schwarz/Weiß-Anzeige (Farbe wenn unterstützt).

source: -o, --port PORT Connect to message server on PORT (default: vboxd/tcp).
de: -o, --port PORT Verbindet zu Server auf Port PORT (vboxd/tcp).

source: -p, --pause SECONDS Pause in seconds to sleep between checks (default: 5).
de: -p, --pause SECONDS Pause in Sekunden zwischen Check's (Voreinstellung: 5).

source: -p, --phone PHONE Sets header information.
de: -p, --phone PHONE Setzt Information im "audio header".

source: -p, --port PORT Connect to port PORT (vboxd/tcp).
de: -p, --port PORT Verbindet zu Port PORT (vboxd/tcp).

source: -p, --stop Control file "vboxctrl-stop".
de: -p, --stop Kontrolldatei "vboxctrl-stop".

source: -q, --quiet Returns only the errorcode (no descriptions).
de: -q, --quiet Nur Fehlernummer zurückgegeben (keine Beschreibung).

source: -r, --reload SECS Reload message list all SECS seconds (%d).
de: -r, --reload SECS Liste nach SECS Sekunden neu laden (%d).

source: -r, --remove Creates a control file.
de: -r, --remove Erzeugt eine Kontrolldatei.

source: -r, --samplerate RATE Header sampling rate (default 8000).
de: -r, --samplerate RATE Samplerate im "audio header" (Voreinstellung 8000).

source: -s, --noledstatus Don't get led status from server (get status).
de: -s, --noledstatus Keinen LED-Status vom Server holen (Status holen).

source: -s, --sound HOURS Hours to signal with sound (default: no time)
de: -s, --sound HOURS Stunden in denen Sound gespielt wird (Voreinst.: keine).

source: -s, --spooldir Spooldirectory to create/remove control files.
de: -s, --spooldir Spoolverzeichnis zum erzeugen/löschen der Kontrolldateien.

source: -u, --ulaw Converts sample to ulaw.
de: -u, --ulaw Konvertiert Datei nach "ulaw".

source: -u, --ulaw Use 8-bit uLaw output.
de: -u, --ulaw 8-Bit ulaw Ausgabe benutzen.

source: -v, --version Prints the package version.
de: -v, --version Zeigt die Version des Programms an.

source: -v, --version Prints the package version.
de: -v, --version Zeigt die Version des Programms an.

source: -v, --version Displays program version.
de: -v, --version Zeigt die Version des Programms an.

source: -v, --version Display program version.
de: -v, --version Zeigt die Version des Programms an.

source: -v, --version Displays the package version.
de: -v, --version Zeigt die Version des Programms an.

source: -v, --version Displays package version.
de: -v, --version Zeigt Version des Programms an.

source: Answer call
de: Anruf wird beantwortet

source: Answering call...
de: Beantworte Anruf...

source: Back from tcl script...
de: Zurück vom Tcl-Skript...

source: Bad flag RINGS in line #%ld (ignored).
de: Falsches Flag RINGS in Zeile #%ld (ignoriert).

source: Bad flag TOLLRINGS in line #%ld (ignored).
de: Falsches Flag TOLLRINGS in Zeile #%ld (ignoriert).

source: Bad initialization - Program will exist on %d trys!
de: Falsche Initialisierung - Programm beendet sich nach %d weiteren Versuchen!

source: Bad number of rings in line #%ld (ignored).
de: Falsche Anzahl Ring's in Zeile #%ld (ignoriert).

source: Bad record time in line #%ld (using defaults).
de: Falsche Aufnahmezeit in Zeile #%ld (benutze Voreinstellung).

source: Bad time; can't convert timestring (%s-%s) - ignored...
de: Falsche Zeit; kann Zeitangabe (%s-%s) nicht konvertieren - ignoriert...

source: Bad time; start greater than end (%s-%s) - ignored...
de: Falsche Zeit; Startzeit ist größer als die Endzeit (%s-%s) - ignoriert...

source: Bad value "%s" for command "%s" ignored (%s)...
de: Falscher Wert "%s" für Kommando "%s" ignoriert (%s)...

source: Blocking all signals (0-%d)...
de: Blockiere alle Signale (0-%d)...

source: Call will be answered after %ld rings (default)...
de: Anruf wird nach %ld Ring's beantwortet (Voreinstellung)...

source: Call will be answered after %ld rings...
de: Anruf wird nach %ld Ring's beantwortet...

source: Call will not be answered - disabled in "vboxrc"...
de: Anruf wird nicht beantwortet - Gesperrt in "vboxrc"...

source: Call will not be answered - no rings are set...
de: Anruf wird nicht beantwortet - Keine Ring's gesetzt...

source: Caller number match user "%s"...
de: Anrufernummer entspricht "%s"...

source: Can only get %d of %d bytes! %s
de: Konnte nur %d von %d Zeichen übertragen! %s

source: Can't answer call -- hanging up...
de: Kann Anruf nicht beantworten - Lege auf...

source: Can't call fcntl() to setup modem port.
de: Kann Modem nicht mit der Funktion 'fcntl()' einstellen.

source: Can't create "%s" (%s).
de: Kann "%s" nicht erzeugen (%s).

source: Can't create "%s".
de: Kann "%s" nicht erzeugen.

source: Can't create all new tcl commands.
de: Kann nicht alle der neuen Tcl-Kommandos erzeugen.

source: Can't create tcl interpreter.
de: Kann den Tcl-Interpreter nicht erzeugen.

source: Can't create temporary file! %s
de: Kann temporäre Datei nicht erzeugen! %s

source: Can't delete; invalid server response! %s
de: Kann nicht lösche; falsche Antwort vom Server! %s

source: Can't delete; no server response! %s
de: Kann nicht löschen; keine Antwort vom Server! %s

source: Can't get end sequence (bad response)! %s
de: Kann Endsequenz nicht holen (falsche Antwort)! %s

source: Can't get end sequence! %s
de: Kann Endsequenz nicht holen! %s

source: Can't get incoming call type - I think it's voice...
de: Kann den Typ des eingehenden Anrufs nicht ermitteln - Sprache wird angenommen...

source: Can't get init sequence (bad response)! %s
de: Kann Einführungssequenz nicht holen (falsche Antwort)! %s

source: Can't get init sequence! %s
de: Kann Einführungssequenz nicht holen! %s

source: Can't get local time (don't match)...
de: Kann die lokale Zeit nicht ermitteln (keine Übereinstimmung)...

source: Can't get modem terminal IO settings (not initialized).
de: Kann die Modem-Terminal-Einstellungen nicht lesen (nicht initialisiert).

source: Can't get passwd entry for userid %d.
de: Kann keinen Paßworteintrag für die Benutzer-ID %d finden.

source: Can't get statistic about disc space!
de: Kann Statistik über die freie Plattenkapazität nicht ermitteln!

source: Can't hangup modem!
de: Kann Modem nicht auflegen!

source: Can't initialize tcl interpreter.
de: Kann den Tcl-Interpreter nicht initialisieren.

source: Can't lock "%s".
de: Kann "%s" nicht sperren.

source: Can't open "%s".
de: Kann "%s" nicht öffnen.

source: Can't open modem port "%s".
de: Kann Modemport "%s" nicht öffnen.

source: Can't open temporary file! %s
de: Kann temporäre Datei nicht öffnen! %s

source: Can't read from modem [%d]%s.
de: Kann nicht vom Modem lesen [%d]%s.

source: Can't read incoming data (%s).
de: Kann eingehende Daten nicht lesen (%s).

source: Can't read input from modem.
de: Kann Daten vom Modem nicht lesen.

source: Can't read modem command echo.
de: Kann das Echo vom Modemkommando nicht lesen.

source: Can't read modem command result.
de: Kann die Antwort vom Modemkommando nicht lesen.

source: Can't read vbox audio header from message.
de: Kann "vbox audio header" nicht lesen.

source: Can't remove control file "%s"!
de: Kann die Kontrolldatei "%s" nicht löschen!

source: Can't remove lock "%s".
de: Kann Sperrung von "%s" nicht entfernen.

source: Can't send modem command.
de: Kann Modemkommando nicht senden.

source: Can't set mode of "%s" (%s).
de: Kann Rechte von "%s" nicht setzen (%s).

source: Can't set modem terminal IO settings (not initialized).
de: Kann Modem-Terminal-Einstellungen nicht setzen (nicht initialisiert).

source: Can't set owner of "%s" (%s).
de: Kann Besitzer von "%s" nicht setzen (%s).

source: Can't set voice audio compressen.
de: Kann die Audio-Kompression nicht setzen.

source: Can't set voice audio compression or line mode.
de: Kann die Audio-Kompression oder den Line-Mode nicht setzen.

source: Can't set working directory to "%s" (%s).
de: Kann nicht nach "%s" wechseln (%s).

source: Can't setregid() to %d, %d (%s).
de: Kann ID nicht zu %d, %d ändern [setregid] (%s).

source: Can't setreuid() to %d, %d (%s).
de: Kann ID nicht zu %d, %d ändern [setreuid] (%s).

source: Can't start record mode.
de: Kann den Aufzeichnungs-Modus nicht starten.

source: Can't start voice play mode.
de: Kann den Abspiel-Modus nicht starten.

source: Can't toggle; invalid server response! %s
de: Kann nicht wechseln; falsche Antwort vom Server! %s

source: Can't toggle; no answer from server! %s
de: Kann nicht wechseln; keine Antwort vom Server! %s

source: Can't write vbox audio header.
de: "Kann "vbox audio header" nicht schreiben.

source: Channels........: %d
de: Kanäle..........: %d

source: Checking for new messages in "%s"...
de: Suche nach neuen Nachrichten in "%s"...

source: Checking free space on "%s"...
de: Überprüfe freie Kapazität auf "%s"...

source: Checking if modem is still alive...
de: Überprüfe ob Modem noch antwortet...

source: Closing modem port (%d)...
de: Schließe Modemport (%d)...

source: Compression.............: %s
de: Kompression.............: %s

source: Connecting to '%s'...
de: Verbinde zu '%s'...

source: Control file "%s" exists - answering now...
de: Kontrolldatei "%s" existiert - Anruf wird gleich beantwortet...

source: Control file "%s" exists - killing me now...
de: Kontrolldatei "%s" existiert - Programm wird beendet...

source: Control file "%s" exists - program will quit...
de: Kontrolldatei "%s" existiert - Programm wird beendet...

source: Control file "%s" exists - rejecting call...
de: Kontrolldatei "%s" existiert - Anruf wird verworfen...

source: Control file "%s" exists - waiting...
de: Kontrolldatei "%s" existiert - Warte...

source: Control file deleted - back in business...
de: Kontrolldatei wurde gelöscht - Back in business...

source: Could only write %d of %d bytes (%s).
de: Kann nur %d von %d Zeichen schreiben (%s).

source: Creation time...........: %s
de: Erzeugungsdatum.........: %s

source: Data location...: %d
de: Datenbereich....: %d

source: Don't answer call
de: Anruf wird nicht beantwortet

source: Don't play beep message
de: Beep-Nachricht wird nicht gespielt

source: Don't play standard message
de: Ansage-Nachricht wird nicht gespielt

source: Don't play timeout message
de: Zeitbegrenzungs-Nachricht wird nicht gespielt

source: Don't record a message
de: Es wird keine Nachricht aufgezeichnet

source: Drop permissions to userid %d; groupid %d...
de: Setze Prozeßrechte auf Benutzer-ID %d; Gruppen-ID %d...

source: End of audio data (%s).
de: Ende der Audio-Daten (%s).

source: Error in "%s": Missing argument (%s).
de: Fehler in "%s": Vermisse Argument (%s).

source: Error in "%s": Missing command.
de: Fehler in "%s": Vermisse Kommando.

source: Error in day string "%s" in line #%ld (don't match).
de: Fehler in Tagesangabe "%s" in Zeile #%ld (keine Übereinstimmung).

source: Error in vboxrc line #%ld (ignored).
de: Fehler in vboxrc Zeile #%ld (ignoriert).

source: Exit program on signal %d...
de: Signal %d erhalten - Beende Programm...

source: Exit program while bad init limit are reached.
de: Programm wird beendet weil das Modem mehrmals nicht initialisiert werden konnte.

source: Flush has junked %d bytes...
de: Es wurden %d Zeichen Datenmüll überlesen...

source: Flushing modem%s...
de: Entleere Modemport%s...

source: Found %d new messages; new number of rings are %d...
de: %d neue Nachricht(en) gefunden; Neue Anzahl Ring's ist %d...

source: Found Flag "%s"...
de: Gefundenes Flag: "%s"...

source: Found command '%s = %s' (%s)...
de: Gefundenes Kommando: '%s = %s' (%s)...

source: Found command '%s = %s'...
de: Gefundenes Kommando: '%s = %s'...

source: Found open modem port (%d).
de: Bereits geöffneter Modemport gefunden (%d).

source: Found sequence "<DLE>
de: Gefundene Sequenz: "<DLE>

source: Found sequence "<DLE><DC4>" (remote hangup)...
de: Gefundene Sequenz: "<DLE><DC4>" (Gegenstellt hat aufgelegt)...

source: Found sequence "<DLE><ETX>" (remote hangup)...
de: Gefundene Sequenz: "<DLE><ETX>" (Gegenstelle hat aufgelegt)...

source: Found touchtone "%c"...
de: Gefundener Touchtone: "%c"...

source: Free disc space check disabled!
de: Die Überprüfung der freien Plattenkapazität wurde abgeschaltet!

source: Function play %d secs (kernel needs %d secs)...
de: Funktion spielte %d Sekunden (Kernel bräuchte %d Sekunden)...

source: Getting control status...
de: Ermittle Kontrollstatus...

source: Getting number of rings to wait before answer call...
de: Ermittle Anzahl Ring's um Anruf zu beantworten...

source: Got "
de: Erhalte "

source: Got it.
de: Erhalten.

source: Got junk line "
de: Erhalte Müllzeile "

source: Got s-register value "%s".
de: Der Inhalt des S-Registers ist "%s".

source: Got unneeded character "
de: Unbenötigtes Zeichen erhalten: "

source: HELP
de: HILFE

source: Hangup modem (drop dtr %d ms)...
de: Lege Modem auf (drop dtr %d ms)...

source: Have input...
de: Es sind Daten da...

source: Hours to play sound with the pc speaker must be specified in 24-hour-format. you can use ',' or '-' to seperate hours or specify time ranges (eg 9,17-22). A '--sound="*"' means at every time and '--sound="-"' means at no time. The option '--messagebox' can be used more than one time, so you can watch max. %d seperate directories.
de: Die Stunden in denen Sound mit dem PC-Lautsprecher gespielt werden darf, müssen im 24-Stunden-Format angegeben werden. Die Zeichen ',' und '-' können benutzt werden um mehrere Zeiten zu trennen oder um Zeitzonen (beispiel: 9,17-22) anzu- geben. Ein '--sound="*"' heißt immer, ein '--sound="-"' zu keiner Zeit. Die Option '--messagebox' kann mehrmals angegeben werden. Es können maximal %d Verzeichnisse gleichzeitig überwacht werden.

source: Illeagal "<DLE>" shielded code "
de: Falsche "<DLE>" Sequenz "

source: In "%s": %s (line %d).
de: In "%s": %s (Zeile %d).

source: Incoming call is not voice - hanging up...
de: Eingehender Anruf ist nicht vom Typ Sprache - Lege auf...

source: Incoming date
de: Eingehendes Datum

source: Initializing modem port (voice mode; %d ms)...
de: Initialisiere Modem (Sprachmodus; %d ms)...

source: Internal modem buffer overflow (size %d; request %d)!
de: Interner Modembuffer ist übergelaufen (Größe %d; Anforderung %d)!

source: Jumping to section "%s"...
de: Springe zur Sektion "%s"...

source: Junk:
de: Müll:

source: Len
de: Länge

source: Length..................: %d seconds
de: Länge...................: %d Sekunden

source: Lock setup for type %d not found.
de: Sperrungs-Einstellungen für Typ %d nicht gefunden.

source: Locking %s (%s)...
de: Sperre %s (%s)...

source: Message size is zero! %s
de: Nachrichtenlänge ist Null! %s

source: Modem returns unneeded command "
de: Modem liefert falsche Rückgabe "

source: New number of rings from "vboxrc" are %d...
de: Neue Anzahl der Ring's von "vboxrc" ist %d...

source: No (or not all) settings found (using defaults)...
de: Keine (oder nicht alle) Einstellungen gefunden (benutze Voreinstellungen)...

source: Not enough memory to allocate lockname.
de: Nicht genug Speicher um Sperrname zu erzeugen.

source: Note: The sampling rate is written into the file header only, it doesn't do any sampling rate conversion!
de: Bemerkung: Die Samplerate wird nur in den "audio header" geschrieben. Es wird keine Konvertierung vorgenommen!

source: Number
de: Nummer

source: Oops - can't calculate time to wait!
de: Huch - Kann die Zeit zum Warten nicht errechnen!

source: Oops!
de: Huch!

source: Opening modem port "%s"...
de: Öffne Modemport "%s"...

source: Parser returns "%s" (min %d; max %d).
de: Übersetzer hat "%s" zurückgegeben (Min %d; Max %d).

source: Parsing day(s) "%s"...
de: Untersuche Tag(e) "%s"...

source: Parsing settings from section "%s"...
de: Übersetze Einstellungen der Sektion "%s"...

source: Parsing settings in "%s" for port "%s"...
de: Übersetze Einstellungen in "%s" für Port "%s"...

source: Parsing time(s) "%s"...
de: Untersuche Zeit(en) "%s"...

source: Password:
de: Passwort:

source: Play beep message
de: Beep-Nachricht wird gespielt
