Repository: marschap/isdn4k-utils
Catalog: vbox/messages/*.po
Languages: de

source: Play standard message
de: Ansage-Nachricht wird gespielt

source: Play timeout message
de: Zeitbegrenzungs-Nachricht wird gespielt

source: Play: <DATA %d incoming; %d outgoing>
de: Abspielen: <DATEN %d eingehend; %d ausgehend>

source: Playing "%s"...
de: Spiele "%s"...

source: Playing message...
de: Spiele Nachricht...

source: Range %s - %s (%s):
de: Bereich %s - %s: keine Übereinstimmung.

source: Range %s: don't match.
de: Bereich %s: keine Übereinstimmung.

source: Range %s: match.
de: Bereich %s: Übereinstimmung.

source: Range **:**:** - **:**:** (%s): match.
de: Bereich **:**:** - **:**:** (%s): Übereinstimmung.

source: Range *: match.
de: Bereich *: Übereinstimmung.

source: Range --:--:-- - --:--:-- (%s): don't match.
de: Bereich Range --:--:-- - --:--:-- (%s): keine Übereinstimmung.

source: Range -: don't match.
de: Bereich -: keine Übereinstimmung.

source: Reading modem %s (%d secs timeout)...
de: Lese Modem-%s (%d Sekunden Zeitbegrenzung)...

source: Reading modem input (%d secs timeout)...
de: Lese Modem-Eingabe (%d Sekunden Zeitbegrenzung)...

source: Really delete all marked messages (y/n)?
de: Wirklich alle markierten Nachrichten löschen (y/n)?

source: Record a message
de: Eine Nachricht wird aufgezeichnet

source: Record: <DATA %d incoming; %d outgoing>
de: Aufzeichnen: <DATEN %d eingehend; %d ausgehend>

source: Recording "%s" (%d secs)...
de: Zeichne "%s" auf (%d Sekunden)...

source: Removing message #%d...
de: Lösche Nachricht #%d...

source: Running tcl script "%s"...
de: Starte Tcl-Skript "%s"...

source: Running vbox version %s...
de: Programmversion vbox: %s...

source: Sampling rate...: %d
de: Samplerate......: %d

source: Searching end sequence...
de: Suche EndSequenz...

source: Searching message...
de: Suche Nachricht...

source: Searching user with caller number "%s"...
de: Suche Name für Anrufernummer "%s"...

source: Section "[%s]" will be used (default)...
de: Sektion "[%s]" wird benutzt (Voreinstellung)...

source: Section "[%s]" will be used...
de: Sektion "[%s]" wird benutzt...

source: Select returns with error (%d)...
de: Warten auf Modemdaten endet mit einem Fehler (%d)...

source: Select returns with timeout...
de: Zeitbegrenzung beim warten auf Modemdaten ist abgelaufen...

source: Sending "
de: Sende "

source: Sending "<DLE><DC4>"...
de: Sende "<DLE><DC4>"...

source: Sending "<DLE><ETX>"...
de: Sende "<DLE><ETX>"...

source: Sequence "%s" found in breaklist...
de: Sequenz "%s" in der Unterbrechungsliste gefunden...

source: Sequence "%s" not in breaklist (ignored)...
de: Sequenz "%s" nicht in der Unterbrechungsliste gefunden (ignoriert)...

source: Setting "%s" to %d.%d (%04o)...
de: Setze Rechte von "%s" auf %d.%d (%04o)...

source: Setting modem flow control (HARD)...
de: Setze Modem-Flußkontrolle (HARD)...

source: Setting modem speed to 57600...
de: Setze Modem-Geschwindigkeit auf 57600...

source: Setting voice compression "%s"...
de: Setze Audio-Kompression "%s"...

source: Settings: %d secs record time.
de: Einstellung: %d Sekunden Aufzeichnungszeit.

source: Settings: %s.
de: Einstellung: %s.

source: Settings: Beep "%s".
de: Einstellung: Beep "%s".

source: Settings: Check for new messages in "%s".
de: Einstellung: Suche nach neuen Nachrichten in "%s".

source: Settings: Message "%s".
de: Einstellung: Ansage "%s".

source: Settings: Rings changed to %d if new message exist.
de: Einstellung: Ring's werden in %d geändert wenn neue Nachrichten existieren.

source: Settings: Rings changed to %d.
de: Einstellung: Anzahl der Ring's geändert in %d.

source: Settings: Rings not changed.
de: Einstellung: Anzahl der Ring's nicht geändert.

source: Settings: Script "%s".
de: Einstellung: Tcl-Skript "%s".

source: Settings: Timeout "%s".
de: Einstellung: Zeitbegrenzung "%s".

source: Size............: %d %s
de: Größe...........: %d %s

source: Speaker caller number...: %s
de: Kennung des Anrufers....: %s

source: Speaker location........: %s
de: Wohnort des Anrufers....: %s

source: Speaker name............: %s
de: Name des Anrufers.......: %s

source: Speaker phone number....: %s
de: Nummer des Anrufers.....: %s

source: String contains no matching day!
de: Tagesangaben enthielten keine Übereinstimmung!

source: String contains no matching time!
de: Zeitangaben enthielten keine Übereinstimmung!

source: Tcl interpreter version %s...
de: Programmversion tcl: %s...

source: The program returns the sample format as errorcode:
de: Das Programm gibt das Dateiformat als Fehlernummer zurück:

source: The spool directory is taken from one of the following:
de: Das Spoolverzeichnis wird wie folgt berechnet:

source: The vbox converter can be called as:
de: Das Konvertierungsprogramm kann unter folgenden Namen gestartet werden:

source: Timeout function called.
de: Zeitbegrenzungs-Funktion wurde aufgerufen!

source: Toggle message new flag...
de: Wechsle Neu-Flag...

source: Touchtone sequence "%s" found.
de: Touchtone-Sequenz "%s" gefunden.

source: Transfering message (%d bytes)...
de: Übertrage Nachricht (%d Zeichen)...

source: Transfering message list...
de: Übertrage Nachrichtenliste...

source: Unable to locate section "%s" (useing defaults)...
de: Kann die Sektion "%s" nicht finden (benutze Voreinstellungen)...

source: Unable to locate section "[CALLERIDS]" (useing defaults)...
de: Kann die Sektion "[CALLERIDS]" nicht finden (benutze Voreinstellungen)...

source: Unable to locate section "[RINGS]" (useing defaults)...
de: Kann die Sektion "[RINGS]" nicht finden (benutze Voreinstellungen)...

source: Unknown command "%s" ignored (%s)...
de: Unbekanntes Kommando "%s" ignoriert (%s)...

source: Unknown compression %d - can't set.
de: Umbekannte Kompression %d - Kann nicht gesetzt werden.

source: Unlocking %s (%s)...
de: Entsperre %s (%s)...

source: Usage: %s OPTION [ OPTION ] [ ... ]
de: Benutzung: %s OPTION [ OPTION ] [ ... ]

source: Usage: %s OPTION [ OPTION ] [ ... ] <INFILE >OUTFILE
de: Benutzung: %s OPTION [ OPTION ] [ ... ] <QUELLDATEI >ZIELDATEI

source: Usage: %s OPTION [ OPTION ] [ ... ] SAMPLENAME
de: Benutzung: %s OPTION [ OPTION ] [ ... ] DATEINAME

source: Use existing lock for "%s" (%d).
de: Benutze existierende Sperrung für "%s" (%d).

source: User %s's messagebox is "%s"...
de: Benutzer %s's Nachrichtenfach ist "%s"...

source: User %s's vbox.conf is "%s"...
de: Benutzer %s's vbox.conf ist "%s"...

source: Wait: <DATA %d incoming>
de: Warte: <DATEN %d eingehend>

source: Waiting %d secs for input...
de: Warte %d Sekunden auf eingehende Daten...

source: Waiting %d secs to complete playing...
de: Warte %d Sekunden bis das Abspielen abgeschlossen ist...

source: Waiting for "
de: Erwarte "

source: Waiting...
de: Warte...

source: Wakeup!
de: Erhalte eingehenden Anruf...

source: You *must* set a user/group (not root)!
de: Es *muß* ein(e) Benutzer/Gruppe gesetzt werden (nicht root)!

source: [READ] Function request %d byte(s) (now pos %d; len %d).
de: [READ] Funktion fordert %d Zeichen an (Position %d; Länge %d).

source: [READ] Read %d bytes (now pos %d; len %d).
de: [READ] %d Zeichen gelesen (Position %d; Länge %d).

source: [READ] Return %d bytes (now pos %d; len %d.
de: [READ] Rückgabe %d Zeichen (Position %d; Länge %d).

source: [READ] Return all %d bytes (now pos %d; len %d).
de: [READ] Rückgabe aller %d Zeichen (Position %d; Länge %d).

source: [READ] Return only %d bytes (now pos %d; len %d).
de: [READ] Rückgabe von nur %d Zeichen (Position %d; Länge %d).

source: [READ] Store %d of %d bytes (now pos 0; len 0).
de: [READ] %d von %d Zeichen gemerkt (Position 0; Länge 0).

source: [READ] Store nothing (pos 0; len 0).
de: [READ] Keine Zeichen gemerkt (Position 0; Länge 0).

source: [RETURN]
de: [EINGABE]

source: [vbox_breaklist] can't add "%s".
de: [vbox_breaklist] kann "%s" nicht hinzunehmen.

source: [vbox_breaklist] usage: vbox_breaklist <rem|add> <sequence> [sequence] [...]
de: [vbox_breaklist] Benutzung: vbox_breaklist <rem|add> <sequenz> [sequenz] [...]

source: [vbox_get_message] result "%s".
de: [vbox_get_message] Ergebnis "%s".

source: [vbox_get_message] usage: vbox_get_message <messagename> <recordtime>
de: [vbox_get_message] Benutzung: vbox_get_message <messagename> <recordtime>

source: [vbox_get_nr_all_messages] counting all messages in "%s"...
de: [vbox_get_nr_all_messages] Zähle alle Nachrichten in "%s"...

source: [vbox_get_nr_all_messages] result "%d".
de: [vbox_get_nr_all_messages] Ergebnis "%d".

source: [vbox_get_nr_all_messages] usage: vbox_get_nr_all_messages <path>
de: [vbox_get_nr_all_messages] Benutzung: vbox_get_nr_all_messages <path>

source: [vbox_get_nr_new_messages] counting new messages in "%s"...
de: [vbox_get_nr_new_messages] Zähle neue Nachrichten in "%s"...

source: [vbox_get_nr_new_messages] result "%d".
de: [vbox_get_nr_new_messages] Ergebnis "%d".

source: [vbox_get_nr_new_messages] usage: vbox_get_nr_new_messages <path>
de: [vbox_get_nr_new_messages] Benutzung: vbox_get_nr_new_messages <path>

source: [vbox_pause] usage: vbox_pause <ms>
de: [vbox_pause] Benutzung: vbox_pause <ms>

source: [vbox_pause] waiting %lu ms...
de: [vbox_pause] Warte %lu ms...

source: [vbox_put_message] result "%s".
de: [vbox_put_message] Ergebnis "%s".

source: [vbox_put_message] usage: vbox_put_message <messagename>
de: [vbox_put_message] Benutzung: vbox_put_message <messagename>

source: [vbox_wait] result "%s".
de: [vbox_wait] Ergebnis "%s".

source: [vbox_wait] usage: vbox_wait <seconds>
de: [vbox_wait] Benutzung: vbox_wait <seconds>

source: alaw not longer supported
de: alaw wird nicht länger unterstützt

source: autovbox - to convert au format samples to vbox messages.
de: autovbox - um eine au-Datei in eine vbox-Nachricht zu konvertieren.

source: bad hour in local time structure (%d).
de: falsche Stunde in der lokalen Zeitstruktur (%d).

source: bad server response "%s".
de: falsche Server Antwort "%s".

source: can't add "%s" to watchlist.
de: kann "%s" nicht zur Überwachungsliste hinzufügen.

source: can't connect to vbox message server.
de: kann Verbindung zum "vbox message server" nicht herstellen.

source: can't convert value to integer
de: kann den Wert nicht in Zahl konvertieren

source: can't get current local time (%s).
de: kann die lokale Zeit nicht ermitteln (%s).

source: can't get server response.
de: kann Antwort vom Server nicht lesen.

source: can't get service vboxd/tcp.
de: kann Service vboxd/tcp nicht finden.

source: can't open "/dev/console" (%s).
de: kann "/dev/console" nicht öffnen (%s).

source: can't remove PID file "%s" (%s).
de: kann die PID-Datei "%s" nicht entfernen (%s).

source: connected to vbox message server.
de: Verbindung zum "vbox message server" hergestellt.

source: could not create PID file "%s" (%s).
de: kann die PID-Datei "%s" nicht erzeugen (%s).

source: disconnecting from server...
de: Verbindung zum "vbox message server" wird beendet...

source: don't match.
de: keine Übereinstimmung.

source: enough.
de: genug.

source: match.
de: Übereinstimmung.

source: new starttime is %ld.
de: die neue Startzeit ist %ld.

source: not enough memory to create pid name.
de: nicht genug Speicher um den Namen der PID zu erzeugen.

source: not enough!
de: nicht genug!

source: sequence
de: Sequenz

source: server connection canceled.
de: Verbindung zum "vbox message server" wurde beendet.

source: server connection lost!
de: Verbindung zum "vbox message server" wurde verloren!

source: start- or endtime out of range.
de: die Start- oder Endzeit ist ausßerhalb der gültigen Werte.

source: starttime must be lower than endtime.
de: die Startzeit muß kleiner als die Endzeit sein.

source: terminate...
de: beendet sich...

source: there are no directories to watch.
de: es sind keine Verzeichnisse zum überwachen angegeben.

source: time range "%s".
de: Zeiten "%s".

source: unknown compression
de: unbekannte Kompression

source: unknown groupname
de: unbekannter Gruppenname

source: unknown umask
de: unbekannte umask

source: unknown username
de: unbekannter Benutzername

source: value too big
de: Wert zu groß

source: value too small
de: Wert zu klein

source: vboxmode - to display message information (works also with au).
de: vboxmode - um Informationen über au- oder vbox-Dateien anzuzeigen.

source: vboxtoau - to convert vbox messages to au format.
de: vboxtoau - um eine vbox-Nachricht in eine au-Datei zu konvertieren.
